betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_adc.c
  (#) Optionally, for devices with several ADC instances: configure the
      multimode parameters using function DAL_ADCEx_MultiModeConfigChannel().

                       *** Execution of ADC conversions ***
  ==============================================================================
  [..]
  (#) ADC driver can be used among three modes: polling, interruption,
      transfer by DMA.

     *** Polling mode IO operation ***
     =================================
     [..]
       (+) Start the ADC peripheral using DAL_ADC_Start()
       (+) Wait for end of conversion using DAL_ADC_PollForConversion(), at this stage
           user can specify the value of timeout according to his end application
       (+) To read the ADC converted values, use the DAL_ADC_GetValue() function.
       (+) Stop the ADC peripheral using DAL_ADC_Stop()

     *** Interrupt mode IO operation ***
     ===================================
     [..]
       (+) Start the ADC peripheral using DAL_ADC_Start_IT()
       (+) Use DAL_ADC_IRQHandler() called under ADC_IRQHandler() Interrupt subroutine
       (+) At ADC end of conversion DAL_ADC_ConvCpltCallback() function is executed and user can
           add his own code by customization of function pointer DAL_ADC_ConvCpltCallback
       (+) In case of ADC Error, DAL_ADC_ErrorCallback() function is executed and user can
           add his own code by customization of function pointer DAL_ADC_ErrorCallback
       (+) Stop the ADC peripheral using DAL_ADC_Stop_IT()

     *** DMA mode IO operation ***
     ==============================
     [..]
       (+) Start the ADC peripheral using DAL_ADC_Start_DMA(), at this stage the user specify the length
           of data to be transferred at each end of conversion
       (+) At The end of data transfer by DAL_ADC_ConvCpltCallback() function is executed and user can
           add his own code by customization of function pointer DAL_ADC_ConvCpltCallback
       (+) In case of transfer Error, DAL_ADC_ErrorCallback() function is executed and user can
           add his own code by customization of function pointer DAL_ADC_ErrorCallback
       (+) Stop the ADC peripheral using DAL_ADC_Stop_DMA()

     *** ADC DAL driver macros list ***
     =============================================
     [..]
       Below the list of most used macros in ADC DAL driver.

      (+) __DAL_ADC_ENABLE : Enable the ADC peripheral
      (+) __DAL_ADC_DISABLE : Disable the ADC peripheral
      (+) __DAL_ADC_ENABLE_IT: Enable the ADC end of conversion interrupt
      (+) __DAL_ADC_DISABLE_IT: Disable the ADC end of conversion interrupt
      (+) __DAL_ADC_GET_IT_SOURCE: Check if the specified ADC interrupt source is enabled or disabled
      (+) __DAL_ADC_CLEAR_FLAG: Clear the ADC's pending flags
      (+) __DAL_ADC_GET_FLAG: Get the selected ADC's flag status
      (+) ADC_GET_RESOLUTION: Return resolution bits in CTRL1 register

     [..]
       (@) You can refer to the ADC DAL driver header file for more useful macros

                      *** Deinitialization of ADC ***
  ==============================================================================
  [..]
  (#) Disable the ADC interface
     (++) ADC clock can be hard reset and disabled at RCC top level.
     (++) Hard reset of ADC peripherals
          using macro __DAL_RCM_ADC_FORCE_RESET(), __DAL_RCM_ADC_RELEASE_RESET().
     (++) ADC clock disable using the equivalent macro/functions as configuration step.
               (+++) Example:
                   Into DAL_ADC_MspDeInit() (recommended code location) or with
                   other device clock parameters configuration:
               (+++) DAL_RCM_GetOscConfig(&RCM_OscInitStructure);
               (+++) RCM_OscInitStructure.OscillatorType = RCM_OSCILLATORTYPE_HSI;
               (+++) RCM_OscInitStructure.HSIState = RCM_HSI_OFF; (if not used for system clock)
               (+++) DAL_RCM_OscConfig(&RCM_OscInitStructure);

  (#) ADC pins configuration
     (++) Disable the clock for the ADC GPIOs using macro __DAL_RCM_GPIOx_CLK_DISABLE()

  (#) Optionally, in case of usage of ADC with interruptions:
     (++) Disable the NVIC for ADC using function DAL_NVIC_DisableIRQ(ADCx_IRQn)

  (#) Optionally, in case of usage of DMA:
        (++) Deinitialize the DMA using function DAL_DMA_DeInit().
        (++) Disable the NVIC for DMA using function DAL_NVIC_DisableIRQ(DMAx_Channelx_IRQn)
                      *** Callback registration ***
  ==============================================================================
    [..]

     The compilation flag USE_DAL_ADC_REGISTER_CALLBACKS, when set to 1,
     allows the user to configure dynamically the driver callbacks.
     Use Functions DAL_ADC_RegisterCallback()
     to register an interrupt callback.
    [..]

     Function DAL_ADC_RegisterCallback() allows to register following callbacks:
       (+) ConvCpltCallback               : ADC conversion complete callback
       (+) ConvHalfCpltCallback           : ADC conversion DMA half-transfer callback
       (+) LevelOutOfWindowCallback       : ADC analog watchdog 1 callback
       (+) ErrorCallback                  : ADC error callback
       (+) InjectedConvCpltCallback       : ADC group injected conversion complete callback
       (+) InjectedQueueOverflowCallback  : ADC group injected context queue overflow callback
       (+) LevelOutOfWindow2Callback      : ADC analog watchdog 2 callback
       (+) LevelOutOfWindow3Callback      : ADC analog watchdog 3 callback
       (+) EndOfSamplingCallback          : ADC end of sampling callback
       (+) MspInitCallback                : ADC Msp Init callback
       (+) MspDeInitCallback              : ADC Msp DeInit callback
     This function takes as parameters the DAL peripheral handle, the Callback ID
     and a pointer to the user callback function.
    [..]

     Use function DAL_ADC_UnRegisterCallback to reset a callback to the default
     weak function.
    [..]

     DAL_ADC_UnRegisterCallback takes as parameters the DAL peripheral handle,
     and the Callback ID.
     This function allows to reset following callbacks:
       (+) ConvCpltCallback               : ADC conversion complete callback
       (+) ConvHalfCpltCallback           : ADC conversion DMA half-transfer callback
       (+) LevelOutOfWindowCallback       : ADC analog watchdog 1 callback
       (+) ErrorCallback                  : ADC error callback
       (+) InjectedConvCpltCallback       : ADC group injected conversion complete callback
       (+) InjectedQueueOverflowCallback  : ADC group injected context queue overflow callback
       (+) LevelOutOfWindow2Callback      : ADC analog watchdog 2 callback
       (+) LevelOutOfWindow3Callback      : ADC analog watchdog 3 callback
       (+) EndOfSamplingCallback          : ADC end of sampling callback
       (+) MspInitCallback                : ADC Msp Init callback
       (+) MspDeInitCallback              : ADC Msp DeInit callback
     [..]

     By default, after the DAL_ADC_Init() and when the state is DAL_ADC_STATE_RESET
     all callbacks are set to the corresponding weak functions:
     examples DAL_ADC_ConvCpltCallback(), DAL_ADC_ErrorCallback().
     Exception done for MspInit and MspDeInit functions that are
     reset to the legacy weak functions in the DAL_ADC_Init()/ DAL_ADC_DeInit() only when
     these callbacks are null (not registered beforehand).
    [..]

     If MspInit or MspDeInit are not null, the DAL_ADC_Init()/ DAL_ADC_DeInit()
     keep and use the user MspInit/MspDeInit callbacks (registered beforehand) whatever the state.
     [..]

     Callbacks can be registered/unregistered in DAL_ADC_STATE_READY state only.
     Exception done MspInit/MspDeInit functions that can be registered/unregistered
     in DAL_ADC_STATE_READY or DAL_ADC_STATE_RESET state,
     thus registered (user) MspInit/DeInit callbacks can be used during the Init/DeInit.
    [..]

     Then, the user first registers the MspInit/MspDeInit user callbacks
     using DAL_ADC_RegisterCallback() before calling DAL_ADC_DeInit()
     or DAL_ADC_Init() function.
     [..]

     When the compilation flag USE_DAL_ADC_REGISTER_CALLBACKS is set to 0 or
     not defined, the callback registration feature is not available and all callbacks
     are set to the corresponding weak functions.

    @endverbatim
  */

/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx_dal.h"

/** @addtogroup APM32F4xx_DAL_Driver
  * @{
  */

/** @defgroup ADC ADC
  * @brief ADC driver modules
  * @{
  */

#ifdef DAL_ADC_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/** @addtogroup ADC_Private_Functions
  * @{
  */
/* Private function prototypes -----------------------------------------------*/
static void ADC_Init(ADC_HandleTypeDef* hadc);
static void ADC_DMAConvCplt(DMA_HandleTypeDef *hdma);
static void ADC_DMAError(DMA_HandleTypeDef *hdma);
static void ADC_DMAHalfConvCplt(DMA_HandleTypeDef *hdma);
/**
  * @}
  */
/* Exported functions --------------------------------------------------------*/
/** @defgroup ADC_Exported_Functions ADC Exported Functions
  * @{
  */

/** @defgroup ADC_Exported_Functions_Group1 Initialization and de-initialization functions
 *  @brief    Initialization and Configuration functions
 *
@verbatim
 ===============================================================================
              ##### Initialization and de-initialization functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Initialize and configure the ADC.
      (+) De-initialize the ADC.

@endverbatim
  * @{
  */

/**
  * @brief  Initializes the ADCx peripheral according to the specified parameters
  *         in the ADC_InitStruct and initializes the ADC MSP.
  *
  * @note   This function is used to configure the global features of the ADC (
  *         ClockPrescaler, Resolution, Data Alignment and number of conversion), however,
  *         the rest of the configuration parameters are specific to the regular
  *         channels group (scan mode activation, continuous mode activation,
  *         External trigger source and edge, DMA continuous request after the
  *         last transfer and End of conversion selection).
  *
  * @param  hadc pointer to a ADC_HandleTypeDef structure that contains
  *         the configuration information for the specified ADC.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_ADC_Init(ADC_HandleTypeDef* hadc)
{
  DAL_StatusTypeDef tmp_dal_status = DAL_OK;

  /* Check ADC handle */
  if(hadc == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_ADC_ALL_INSTANCE(hadc->Instance));
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F411xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
  ASSERT_PARAM(IS_ADC_CLOCKPRESCALER(hadc->Init.ClockPrescaler));
  ASSERT_PARAM(IS_ADC_RESOLUTION(hadc->Init.Resolution));
  ASSERT_PARAM(IS_FUNCTIONAL_STATE(hadc->Init.DMAContinuousRequests));
  ASSERT_PARAM(IS_ADC_EOCSelection(hadc->Init.EOCSelection));
#endif /* APM32F405xx || APM32F407xx || APM32F411xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
  ASSERT_PARAM(IS_FUNCTIONAL_STATE(hadc->Init.ScanConvMode));
  ASSERT_PARAM(IS_FUNCTIONAL_STATE(hadc->Init.ContinuousConvMode));
  ASSERT_PARAM(IS_ADC_EXT_TRIG(hadc->Init.ExternalTrigConv));
  ASSERT_PARAM(IS_ADC_DATA_ALIGN(hadc->Init.DataAlign));
  ASSERT_PARAM(IS_ADC_REGULAR_LENGTH(hadc->Init.NbrOfConversion));
  ASSERT_PARAM(IS_FUNCTIONAL_STATE(hadc->Init.DiscontinuousConvMode));

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F411xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
  if(hadc->Init.ExternalTrigConv != ADC_SOFTWARE_START)
  {
    ASSERT_PARAM(IS_ADC_EXT_TRIG_EDGE(hadc->Init.ExternalTrigConvEdge));
  }
#endif /* APM32F405xx || APM32F407xx || APM32F411xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

