betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_adc.c
    /* Process unlocked */
    /* Unlock before starting ADC conversions: in case of potential           */
    /* interruption, to let the process to ADC IRQ Handler.                   */
    __DAL_UNLOCK(hadc);

#if defined(APM32F403xx) || defined(APM32F402xx)
    /* Clear regular group conversion flag */
    __DAL_ADC_CLEAR_FLAG(hadc, ADC_FLAG_EOC);

    /* Check if Multimode enabled and software start selected */
    if(ADC_IS_SOFTWARE_START_REGULAR(hadc) &&
       ADC_NONMULTIMODE_OR_MULTIMODEMASTER(hadc))
    {
      /* Start ADC conversion on regular group with SW start */
      SET_BIT(hadc->Instance->CTRL2, (ADC_CTRL2_REGSWSC | ADC_CTRL2_REGEXTTRGEN));
    }
    else
    {
      /* Start ADC conversion on regular group with external trigger */
      SET_BIT(hadc->Instance->CTRL2, ADC_CTRL2_REGEXTTRGEN);
    }
#else
   /* Pointer to the common control register to which is belonging hadc    */
    /* (Depending on APM32F4 product, there may be up to 3 ADCs and 1 common */
    /* control register)                                                    */
    tmpADC_Common = ADC_COMMON_REGISTER(hadc);

    /* Clear regular group conversion flag and overrun flag */
    /* (To ensure of no unknown state from potential previous ADC operations) */
    __DAL_ADC_CLEAR_FLAG(hadc, ADC_FLAG_EOC | ADC_FLAG_OVR);

    /* Check if Multimode enabled */
    if(DAL_IS_BIT_CLR(tmpADC_Common->CCTRL, ADC_CCTRL_ADCMSEL))
    {
#if defined(ADC2) && defined(ADC3)
      if((hadc->Instance == ADC1) || ((hadc->Instance == ADC2) && ((ADC->CCTRL & ADC_CCTRL_ADCMSEL_Msk) < ADC_CCTRL_ADCMSEL_0)) \
                                  || ((hadc->Instance == ADC3) && ((ADC->CCTRL & ADC_CCTRL_ADCMSEL_Msk) < ADC_CCTRL_ADCMSEL_4)))
      {
#endif /* ADC2 || ADC3 */
        /* if no external trigger present enable software conversion of regular channels */
        if((hadc->Instance->CTRL2 & ADC_CTRL2_REGEXTTRGEN) == RESET)
        {
          /* Enable the selected ADC software conversion for regular group */
          hadc->Instance->CTRL2 |= (uint32_t)ADC_CTRL2_REGSWSC;
        }
#if defined(ADC2) && defined(ADC3)
      }
#endif /* ADC2 || ADC3 */
    }
    else
    {
      /* if instance of handle correspond to ADC1 and  no external trigger present enable software conversion of regular channels */
      if((hadc->Instance == ADC1) && ((hadc->Instance->CTRL2 & ADC_CTRL2_REGEXTTRGEN) == RESET))
      {
        /* Enable the selected ADC software conversion for regular group */
          hadc->Instance->CTRL2 |= (uint32_t)ADC_CTRL2_REGSWSC;
      }
    }
#endif /* APM32F403xx || APM32F402xx */
  }
  else
  {
    /* Update ADC state machine to error */
    SET_BIT(hadc->State, DAL_ADC_STATE_ERROR_INTERNAL);

    /* Set ADC error code to ADC IP internal error */
    SET_BIT(hadc->ErrorCode, DAL_ADC_ERROR_INTERNAL);
  }

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Disables ADC and stop conversion of regular channels.
  *
  * @note   Caution: This function will stop also injected channels.
  *
  * @param  hadc pointer to a ADC_HandleTypeDef structure that contains
  *         the configuration information for the specified ADC.
  *
  * @retval DAL status.
  */
DAL_StatusTypeDef DAL_ADC_Stop(ADC_HandleTypeDef* hadc)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_ADC_ALL_INSTANCE(hadc->Instance));

  /* Process locked */
  __DAL_LOCK(hadc);

  /* Stop potential conversion on going, on regular and injected groups */
  /* Disable ADC peripheral */
  __DAL_ADC_DISABLE(hadc);

  /* Check if ADC is effectively disabled */
  if(DAL_IS_BIT_CLR(hadc->Instance->CTRL2, ADC_CTRL2_ADCEN))
  {
    /* Set ADC state */
    ADC_STATE_CLR_SET(hadc->State,
                      DAL_ADC_STATE_REG_BUSY | DAL_ADC_STATE_INJ_BUSY,
                      DAL_ADC_STATE_READY);
  }

  /* Process unlocked */
  __DAL_UNLOCK(hadc);

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Poll for regular conversion complete
  * @note   ADC conversion flags EOS (end of sequence) and EOC (end of
  *         conversion) are cleared by this function.
  * @note   This function cannot be used in a particular setup: ADC configured
  *         in DMA mode and polling for end of each conversion (ADC init
  *         parameter "EOCSelection" set to ADC_EOC_SINGLE_CONV).
  *         In this case, DMA resets the flag EOC and polling cannot be
  *         performed on each conversion. Nevertheless, polling can still
  *         be performed on the complete sequence.
  * @param  hadc pointer to a ADC_HandleTypeDef structure that contains
  *         the configuration information for the specified ADC.
  * @param  Timeout Timeout value in millisecond.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_ADC_PollForConversion(ADC_HandleTypeDef* hadc, uint32_t Timeout)
{
  uint32_t tickstart = 0U;

  /* Verification that ADC configuration is compliant with polling for      */
  /* each conversion:                                                       */
  /* Particular case is ADC configured in DMA mode and ADC sequencer with   */
  /* several ranks and polling for end of each conversion.                  */
  /* For code simplicity sake, this particular case is generalized to       */
  /* ADC configured in DMA mode and polling for end of each conversion.     */
#if defined(APM32F403xx) || defined(APM32F402xx)
  if (DAL_IS_BIT_SET(hadc->Instance->CTRL2, ADC_CTRL2_DMAEN))
#else
  if (DAL_IS_BIT_SET(hadc->Instance->CTRL2, ADC_CTRL2_EOCSEL) &&
      DAL_IS_BIT_SET(hadc->Instance->CTRL2, ADC_CTRL2_DMAEN)    )
#endif /* APM32F403xx || APM32F402xx */
  {
    /* Update ADC state machine to error */
    SET_BIT(hadc->State, DAL_ADC_STATE_ERROR_CONFIG);

    /* Process unlocked */
    __DAL_UNLOCK(hadc);

    return DAL_ERROR;
  }

  /* Get tick */
  tickstart = DAL_GetTick();

  /* Check End of conversion flag */
  while(!(__DAL_ADC_GET_FLAG(hadc, ADC_FLAG_EOC)))
  {
    /* Check if timeout is disabled (set to infinite wait) */
    if(Timeout != DAL_MAX_DELAY)
    {
      if((Timeout == 0U) || ((DAL_GetTick() - tickstart ) > Timeout))
      {
        /* New check to avoid false timeout detection in case of preemption */
        if(!(__DAL_ADC_GET_FLAG(hadc, ADC_FLAG_EOC)))
        {
          /* Update ADC state machine to timeout */
          SET_BIT(hadc->State, DAL_ADC_STATE_TIMEOUT);

