betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_adc.c
    /* Process unlocked */
    /* Unlock before starting ADC conversions: in case of potential           */
    /* interruption, to let the process to ADC IRQ Handler.                   */
    __DAL_UNLOCK(hadc);

#if defined(APM32F403xx) || defined(APM32F402xx)
    /* Clear regular group conversion flag */
    __DAL_ADC_CLEAR_FLAG(hadc, ADC_FLAG_EOC);

    /* Enable end of conversion interrupt for regular group */
    __DAL_ADC_ENABLE_IT(hadc, ADC_IT_EOC);

    /* Check if Multimode enabled and software start selected */
    if (ADC_IS_SOFTWARE_START_REGULAR(hadc)      &&
        ADC_NONMULTIMODE_OR_MULTIMODEMASTER(hadc)  )
    {
      /* Start ADC conversion on regular group with SW start */
      SET_BIT(hadc->Instance->CTRL2, (ADC_CTRL2_REGSWSC | ADC_CTRL2_REGEXTTRGEN));
    }
    else
    {
      /* Start ADC conversion on regular group with external trigger */
      SET_BIT(hadc->Instance->CTRL2, ADC_CTRL2_REGEXTTRGEN);
    }
#else
    /* Pointer to the common control register to which is belonging hadc    */
    /* (Depending on APM32F4 product, there may be up to 3 ADCs and 1 common */
    /* control register)                                                    */
    tmpADC_Common = ADC_COMMON_REGISTER(hadc);

    /* Clear regular group conversion flag and overrun flag */
    /* (To ensure of no unknown state from potential previous ADC operations) */
    __DAL_ADC_CLEAR_FLAG(hadc, ADC_FLAG_EOC | ADC_FLAG_OVR);

    /* Enable end of conversion interrupt for regular group */
    __DAL_ADC_ENABLE_IT(hadc, (ADC_IT_EOC | ADC_IT_OVR));

    /* Check if Multimode enabled */
    if(DAL_IS_BIT_CLR(tmpADC_Common->CCTRL, ADC_CCTRL_ADCMSEL))
    {
#if defined(ADC2) && defined(ADC3)
      if((hadc->Instance == ADC1) || ((hadc->Instance == ADC2) && ((ADC->CCTRL & ADC_CCTRL_ADCMSEL_Msk) < ADC_CCTRL_ADCMSEL_0)) \
                                  || ((hadc->Instance == ADC3) && ((ADC->CCTRL & ADC_CCTRL_ADCMSEL_Msk) < ADC_CCTRL_ADCMSEL_4)))
      {
#endif /* ADC2 || ADC3 */
        /* if no external trigger present enable software conversion of regular channels */
        if((hadc->Instance->CTRL2 & ADC_CTRL2_REGEXTTRGEN) == RESET)
        {
          /* Enable the selected ADC software conversion for regular group */
          hadc->Instance->CTRL2 |= (uint32_t)ADC_CTRL2_REGSWSC;
        }
#if defined(ADC2) && defined(ADC3)
      }
#endif /* ADC2 || ADC3 */
    }
    else
    {
      /* if instance of handle correspond to ADC1 and  no external trigger present enable software conversion of regular channels */
      if((hadc->Instance == ADC1) && ((hadc->Instance->CTRL2 & ADC_CTRL2_REGEXTTRGEN) == RESET))
      {
        /* Enable the selected ADC software conversion for regular group */
          hadc->Instance->CTRL2 |= (uint32_t)ADC_CTRL2_REGSWSC;
      }
    }
#endif /* APM32F403xx || APM32F402xx */
  }
  else
  {
    /* Update ADC state machine to error */
    SET_BIT(hadc->State, DAL_ADC_STATE_ERROR_INTERNAL);

    /* Set ADC error code to ADC IP internal error */
    SET_BIT(hadc->ErrorCode, DAL_ADC_ERROR_INTERNAL);
  }

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Disables the interrupt and stop ADC conversion of regular channels.
  *
  * @note   Caution: This function will stop also injected channels.
  *
  * @param  hadc pointer to a ADC_HandleTypeDef structure that contains
  *         the configuration information for the specified ADC.
  * @retval DAL status.
  */
DAL_StatusTypeDef DAL_ADC_Stop_IT(ADC_HandleTypeDef* hadc)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_ADC_ALL_INSTANCE(hadc->Instance));

  /* Process locked */
  __DAL_LOCK(hadc);

  /* Stop potential conversion on going, on regular and injected groups */
  /* Disable ADC peripheral */
  __DAL_ADC_DISABLE(hadc);

  /* Check if ADC is effectively disabled */
  if(DAL_IS_BIT_CLR(hadc->Instance->CTRL2, ADC_CTRL2_ADCEN))
  {
#if defined(APM32F403xx) || defined(APM32F402xx)
    /* Disable ADC end of conversion interrupt for regular group */
    __DAL_ADC_DISABLE_IT(hadc, ADC_IT_EOC);
#else
    /* Disable ADC end of conversion interrupt for regular group */
    __DAL_ADC_DISABLE_IT(hadc, (ADC_IT_EOC | ADC_IT_OVR));
#endif /* APM32F403xx || APM32F402xx */

    /* Set ADC state */
    ADC_STATE_CLR_SET(hadc->State,
                      DAL_ADC_STATE_REG_BUSY | DAL_ADC_STATE_INJ_BUSY,
                      DAL_ADC_STATE_READY);
  }

  /* Process unlocked */
  __DAL_UNLOCK(hadc);

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Handles ADC interrupt request
  * @param  hadc pointer to a ADC_HandleTypeDef structure that contains
  *         the configuration information for the specified ADC.
  * @retval None
  */
void DAL_ADC_IRQHandler(ADC_HandleTypeDef* hadc)
{
  uint32_t tmp1 = 0U, tmp2 = 0U;

  uint32_t tmp_sr = hadc->Instance->STS;
  uint32_t tmp_cr1 = hadc->Instance->CTRL1;

  /* Check the parameters */
  ASSERT_PARAM(IS_FUNCTIONAL_STATE(hadc->Init.ContinuousConvMode));
  ASSERT_PARAM(IS_ADC_REGULAR_LENGTH(hadc->Init.NbrOfConversion));
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F411xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
  ASSERT_PARAM(IS_ADC_EOCSelection(hadc->Init.EOCSelection));
#endif /* APM32F405xx || APM32F407xx || APM32F411xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

  tmp1 = tmp_sr & ADC_FLAG_EOC;
  tmp2 = tmp_cr1 & ADC_IT_EOC;
  /* Check End of conversion flag for regular channels */
  if(tmp1 && tmp2)
  {
    /* Update state machine on conversion status if not in error state */
    if (DAL_IS_BIT_CLR(hadc->State, DAL_ADC_STATE_ERROR_INTERNAL))
    {
      /* Set ADC state */
      SET_BIT(hadc->State, DAL_ADC_STATE_REG_EOC);
    }

    /* Determine whether any further conversion upcoming on group regular   */
    /* by external trigger, continuous mode or scan sequence on going.      */
    /* Note: On APM32F4, there is no independent flag of end of sequence.   */
    /*       The test of scan sequence on going is done either with scan    */
    /*       sequence disabled or with end of conversion flag set to        */
    /*       of end of sequence.                                            */
#if defined(APM32F403xx) || defined(APM32F402xx)
    if(ADC_IS_SOFTWARE_START_REGULAR(hadc)                   &&
       (hadc->Init.ContinuousConvMode == DISABLE))
#else
    if(ADC_IS_SOFTWARE_START_REGULAR(hadc)                   &&
       (hadc->Init.ContinuousConvMode == DISABLE)            &&
       (DAL_IS_BIT_CLR(hadc->Instance->REGSEQ1, ADC_REGSEQ1_REGSEQLEN) ||
        DAL_IS_BIT_CLR(hadc->Instance->CTRL2, ADC_CTRL2_EOCSEL)  )   )
#endif /* APM32F403xx || APM32F402xx */
    {
      /* Disable ADC end of single conversion interrupt on group regular */
      /* Note: Overrun interrupt was enabled with EOC interrupt in          */
      /* DAL_ADC_Start_IT(), but is not disabled here because can be used   */
      /* by overrun IRQ process below.                                      */
      __DAL_ADC_DISABLE_IT(hadc, ADC_IT_EOC);

