betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_adc.c
/** @defgroup ADC_Exported_Functions_Group3 Peripheral Control functions
 *  @brief   	Peripheral Control functions
 *
@verbatim
 ===============================================================================
             ##### Peripheral Control functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Configure regular channels.
      (+) Configure injected channels.
      (+) Configure multimode.
      (+) Configure the analog watch dog.

@endverbatim
  * @{
  */

  /**
  * @brief  Configures for the selected ADC regular channel its corresponding
  *         rank in the sequencer and its sample time.
  * @param  hadc pointer to a ADC_HandleTypeDef structure that contains
  *         the configuration information for the specified ADC.
  * @param  sConfig ADC configuration structure.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_ADC_ConfigChannel(ADC_HandleTypeDef* hadc, ADC_ChannelConfTypeDef* sConfig)
{
  __IO uint32_t counter = 0U;
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F411xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
  ADC_Common_TypeDef *tmpADC_Common;
#endif /* APM32F405xx || APM32F407xx || APM32F411xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

  /* Check the parameters */
  ASSERT_PARAM(IS_ADC_CHANNEL(sConfig->Channel));
  ASSERT_PARAM(IS_ADC_REGULAR_RANK(sConfig->Rank));
  ASSERT_PARAM(IS_ADC_SAMPLE_TIME(sConfig->SamplingTime));

  /* Process locked */
  __DAL_LOCK(hadc);

  /* if ADC_Channel_10 ... ADC_Channel_18 is selected */
  if (sConfig->Channel > ADC_CHANNEL_9)
  {
    /* Clear the old sample time */
    hadc->Instance->SMPTIM1 &= ~ADC_SMPTIM1(ADC_SMPTIM1_SMPCYCCFG10, sConfig->Channel);

    /* Set the new sample time */
    hadc->Instance->SMPTIM1 |= ADC_SMPTIM1(sConfig->SamplingTime, sConfig->Channel);
  }
  else /* ADC_Channel include in ADC_Channel_[0..9] */
  {
    /* Clear the old sample time */
    hadc->Instance->SMPTIM2 &= ~ADC_SMPTIM2(ADC_SMPTIM2_SMPCYCCFG0, sConfig->Channel);

    /* Set the new sample time */
    hadc->Instance->SMPTIM2 |= ADC_SMPTIM2(sConfig->SamplingTime, sConfig->Channel);
  }

  /* For Rank 1 to 6 */
  if (sConfig->Rank < 7U)
  {
    /* Clear the old REGSEQCx bits for the selected rank */
    hadc->Instance->REGSEQ3 &= ~ADC_REGSEQ3_RK(ADC_REGSEQ3_REGSEQC1, sConfig->Rank);

    /* Set the REGSEQCx bits for the selected rank */
    hadc->Instance->REGSEQ3 |= ADC_REGSEQ3_RK(sConfig->Channel, sConfig->Rank);
  }
  /* For Rank 7 to 12 */
  else if (sConfig->Rank < 13U)
  {
    /* Clear the old REGSEQCx bits for the selected rank */
    hadc->Instance->REGSEQ2 &= ~ADC_REGSEQ2_RK(ADC_REGSEQ2_REGSEQC7, sConfig->Rank);

    /* Set the REGSEQCx bits for the selected rank */
    hadc->Instance->REGSEQ2 |= ADC_REGSEQ2_RK(sConfig->Channel, sConfig->Rank);
  }
  /* For Rank 13 to 16 */
  else
  {
    /* Clear the old REGSEQCx bits for the selected rank */
    hadc->Instance->REGSEQ1 &= ~ADC_REGSEQ1_RK(ADC_REGSEQ1_REGSEQC13, sConfig->Rank);

    /* Set the REGSEQCx bits for the selected rank */
    hadc->Instance->REGSEQ1 |= ADC_REGSEQ1_RK(sConfig->Channel, sConfig->Rank);
  }

#if defined(APM32F403xx) || defined(APM32F402xx)
  /* If ADC1 Channel_16 or Channel_17 is selected, enable Temperature sensor  */
  /* and VREFINT measurement path.                                            */
  if ((sConfig->Channel == ADC_CHANNEL_TEMPSENSOR) || (sConfig->Channel == ADC_CHANNEL_VREFINT))
  {
    /* For APM32F402/403xx devices with several ADC: Only ADC1 can access internal    */
    /* measurement channels (VrefInt/TempSensor). If these channels are       */
    /* intended to be set on other ADC instances, an error is reported.       */
    if (hadc->Instance == ADC1)
    {
      if (READ_BIT(hadc->Instance->CTRL2, ADC_CTRL2_TSVREFEN) == RESET)
      {
        SET_BIT(hadc->Instance->CTRL2, ADC_CTRL2_TSVREFEN);

        if (sConfig->Channel == ADC_CHANNEL_TEMPSENSOR)
        {
          /* Delay for temperature sensor stabilization time */
          /* Compute number of CPU cycles to wait for */
          counter = (ADC_TEMPSENSOR_DELAY_US * (SystemCoreClock / 1000000U));
          while(counter != 0U)
          {
            counter--;
          }
        }
      }
    }
    else
    {
      /* Update ADC state machine to error */
      SET_BIT(hadc->State, DAL_ADC_STATE_ERROR_CONFIG);
    }
  }
#else
    /* Pointer to the common control register to which is belonging hadc    */
    /* (Depending on APM32F4 product, there may be up to 3 ADCs and 1 common */
    /* control register)                                                    */
    tmpADC_Common = ADC_COMMON_REGISTER(hadc);

  /* if ADC1 Channel_18 is selected for VBAT Channel ennable VBATE */
  if ((hadc->Instance == ADC1) && (sConfig->Channel == ADC_CHANNEL_VBAT))
  {
    /* Disable the TEMPSENSOR channel in case of using board with multiplixed ADC_CHANNEL_VBAT & ADC_CHANNEL_TEMPSENSOR*/
    if ((uint16_t)ADC_CHANNEL_TEMPSENSOR == (uint16_t)ADC_CHANNEL_VBAT)
    {
      tmpADC_Common->CCTRL &= ~ADC_CCTRL_TSVREFEN;
    }
    /* Enable the VBAT channel*/
    tmpADC_Common->CCTRL |= ADC_CCTRL_VBATEN;
  }

  /* if ADC1 Channel_16 or Channel_18 is selected for Temperature sensor or
     Channel_17 is selected for VREFINT enable TSVREFEN */
  if ((hadc->Instance == ADC1) && ((sConfig->Channel == ADC_CHANNEL_TEMPSENSOR) || (sConfig->Channel == ADC_CHANNEL_VREFINT)))
  {
    /* Disable the VBAT channel in case of using board with multiplixed ADC_CHANNEL_VBAT & ADC_CHANNEL_TEMPSENSOR*/
    if ((uint16_t)ADC_CHANNEL_TEMPSENSOR == (uint16_t)ADC_CHANNEL_VBAT)
    {
      tmpADC_Common->CCTRL &= ~ADC_CCTRL_VBATEN;
    }
    /* Enable the Temperature sensor and VREFINT channel*/
    tmpADC_Common->CCTRL |= ADC_CCTRL_TSVREFEN;

    if(sConfig->Channel == ADC_CHANNEL_TEMPSENSOR)
    {
      /* Delay for temperature sensor stabilization time */
      /* Compute number of CPU cycles to wait for */
      counter = (ADC_TEMPSENSOR_DELAY_US * (SystemCoreClock / 1000000U));
      while(counter != 0U)
      {
        counter--;
      }
    }
  }
#endif /* APM32F403xx || APM32F402xx */

