betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_adc.c
  /* Process unlocked */
  __DAL_UNLOCK(hadc);

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Configures the analog watchdog.
  * @note Analog watchdog thresholds can be modified while ADC conversion
  * is on going.
  * In this case, some constraints must be taken into account:
  * The programmed threshold values are effective from the next
  * ADC EOC (end of unitary conversion).
  * Considering that registers write delay may happen due to
  * bus activity, this might cause an uncertainty on the
  * effective timing of the new programmed threshold values.
  * @param  hadc pointer to a ADC_HandleTypeDef structure that contains
  *         the configuration information for the specified ADC.
  * @param  AnalogWDGConfig  pointer to an ADC_AnalogWDGConfTypeDef structure
  *         that contains the configuration information of ADC analog watchdog.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_ADC_AnalogWDGConfig(ADC_HandleTypeDef* hadc, ADC_AnalogWDGConfTypeDef* AnalogWDGConfig)
{
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F411xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#ifdef USE_FULL_ASSERT
  uint32_t tmp = 0U;
#endif /* USE_FULL_ASSERT  */
#endif /* APM32F405xx || APM32F407xx || APM32F411xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

  /* Check the parameters */
  ASSERT_PARAM(IS_ADC_ANALOG_WATCHDOG(AnalogWDGConfig->WatchdogMode));
  ASSERT_PARAM(IS_ADC_CHANNEL(AnalogWDGConfig->Channel));
  ASSERT_PARAM(IS_FUNCTIONAL_STATE(AnalogWDGConfig->ITMode));

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F411xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#ifdef USE_FULL_ASSERT
  tmp = ADC_GET_RESOLUTION(hadc);
  ASSERT_PARAM(IS_ADC_RANGE(tmp, AnalogWDGConfig->HighThreshold));
  ASSERT_PARAM(IS_ADC_RANGE(tmp, AnalogWDGConfig->LowThreshold));
#endif /* USE_FULL_ASSERT  */
#else
  ASSERT_PARAM(IS_ADC_RANGE(AnalogWDGConfig->HighThreshold));
  ASSERT_PARAM(IS_ADC_RANGE(AnalogWDGConfig->LowThreshold));
#endif /* APM32F405xx || APM32F407xx || APM32F411xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

  /* Process locked */
  __DAL_LOCK(hadc);

  if(AnalogWDGConfig->ITMode == ENABLE)
  {
    /* Enable the ADC Analog watchdog interrupt */
    __DAL_ADC_ENABLE_IT(hadc, ADC_IT_AWD);
  }
  else
  {
    /* Disable the ADC Analog watchdog interrupt */
    __DAL_ADC_DISABLE_IT(hadc, ADC_IT_AWD);
  }

  /* Clear REGAWDEN, INJAWDEN and AWDSGLEN bits */
  hadc->Instance->CTRL1 &=  ~(ADC_CTRL1_AWDSGLEN | ADC_CTRL1_INJAWDEN | ADC_CTRL1_REGAWDEN);

  /* Set the analog watchdog enable mode */
  hadc->Instance->CTRL1 |= AnalogWDGConfig->WatchdogMode;

  /* Set the high threshold */
  hadc->Instance->AWDHT = AnalogWDGConfig->HighThreshold;

  /* Set the low threshold */
  hadc->Instance->AWDLT = AnalogWDGConfig->LowThreshold;

  /* Clear the Analog watchdog channel select bits */
  hadc->Instance->CTRL1 &= ~ADC_CTRL1_AWDCHSEL;

  /* Set the Analog watchdog channel */
  hadc->Instance->CTRL1 |= (uint32_t)((uint16_t)(AnalogWDGConfig->Channel));

  /* Process unlocked */
  __DAL_UNLOCK(hadc);

  /* Return function status */
  return DAL_OK;
}

/**
  * @}
  */

/** @defgroup ADC_Exported_Functions_Group4 ADC Peripheral State functions
 *  @brief   ADC Peripheral State functions
 *
@verbatim
 ===============================================================================
            ##### Peripheral State and errors functions #####
 ===============================================================================
    [..]
    This subsection provides functions allowing to
      (+) Check the ADC state
      (+) Check the ADC Error

@endverbatim
  * @{
  */

/**
  * @brief  return the ADC state
  * @param  hadc pointer to a ADC_HandleTypeDef structure that contains
  *         the configuration information for the specified ADC.
  * @retval DAL state
  */
uint32_t DAL_ADC_GetState(ADC_HandleTypeDef* hadc)
{
  /* Return ADC state */
  return hadc->State;
}

/**
  * @brief  Return the ADC error code
  * @param  hadc pointer to a ADC_HandleTypeDef structure that contains
  *         the configuration information for the specified ADC.
  * @retval ADC Error Code
  */
uint32_t DAL_ADC_GetError(ADC_HandleTypeDef *hadc)
{
  return hadc->ErrorCode;
}

/**
  * @}
  */

/** @addtogroup ADC_Private_Functions
  * @{
  */

/**
  * @brief  Initializes the ADCx peripheral according to the specified parameters
  *         in the ADC_InitStruct without initializing the ADC MSP.
  * @param  hadc pointer to a ADC_HandleTypeDef structure that contains
  *         the configuration information for the specified ADC.
  * @retval None
  */
static void ADC_Init(ADC_HandleTypeDef* hadc)
{
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F411xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
  ADC_Common_TypeDef *tmpADC_Common;

  /* Set ADC parameters */
  /* Pointer to the common control register to which is belonging hadc    */
  /* (Depending on APM32F4 product, there may be up to 3 ADCs and 1 common */
  /* control register)                                                    */
  tmpADC_Common = ADC_COMMON_REGISTER(hadc);

  /* Set the ADC clock prescaler */
  tmpADC_Common->CCTRL &= ~(ADC_CCTRL_ADCPRE);
  tmpADC_Common->CCTRL |=  hadc->Init.ClockPrescaler;

  /* Set ADC resolution */
  hadc->Instance->CTRL1 &= ~(ADC_CTRL1_RESSEL);
  hadc->Instance->CTRL1 |=  hadc->Init.Resolution;
#endif /* APM32F405xx || APM32F407xx || APM32F411xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

  /* Set ADC scan mode */
  hadc->Instance->CTRL1 &= ~(ADC_CTRL1_SCANEN);
  hadc->Instance->CTRL1 |=  ADC_CTRL1_SCANENCONV(hadc->Init.ScanConvMode);

  /* Set ADC data alignment */
  hadc->Instance->CTRL2 &= ~(ADC_CTRL2_DALIGNCFG);
  hadc->Instance->CTRL2 |= hadc->Init.DataAlign;

