betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_adc.c
  /* Enable external trigger if trigger selection is different of software  */
  /* start.                                                                 */
  /* Note: This configuration keeps the hardware feature of parameter       */
  /*       ExternalTrigConvEdge "trigger edge none" equivalent to           */
  /*       software start.                                                  */
  if(hadc->Init.ExternalTrigConv != ADC_SOFTWARE_START)
  {
    /* Select external trigger to start conversion */
    hadc->Instance->CTRL2 &= ~(ADC_CTRL2_REGEXTTRGSEL);
    hadc->Instance->CTRL2 |= hadc->Init.ExternalTrigConv;

    /* Select external trigger polarity */
    hadc->Instance->CTRL2 &= ~(ADC_CTRL2_REGEXTTRGEN);
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F411xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
    hadc->Instance->CTRL2 |= hadc->Init.ExternalTrigConvEdge;
#endif /* APM32F405xx || APM32F407xx || APM32F411xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
  }
  else
  {
    /* Reset the external trigger */
    hadc->Instance->CTRL2 &= ~(ADC_CTRL2_REGEXTTRGSEL);
#if defined(APM32F403xx) || defined(APM32F402xx)
    hadc->Instance->CTRL2 |= hadc->Init.ExternalTrigConv;
#endif /* APM32F403xx || APM32F402xx */
    hadc->Instance->CTRL2 &= ~(ADC_CTRL2_REGEXTTRGEN);
  }

  /* Enable or disable ADC continuous conversion mode */
  hadc->Instance->CTRL2 &= ~(ADC_CTRL2_CONTCEN);
  hadc->Instance->CTRL2 |= ADC_CTRL2_CONTCENINUOUS((uint32_t)hadc->Init.ContinuousConvMode);

  if(hadc->Init.DiscontinuousConvMode != DISABLE)
  {
    ASSERT_PARAM(IS_ADC_REGULAR_DISC_NUMBER(hadc->Init.NbrOfDiscConversion));

    /* Enable the selected ADC regular discontinuous mode */
    hadc->Instance->CTRL1 |= (uint32_t)ADC_CTRL1_REGDISCEN;

    /* Set the number of channels to be converted in discontinuous mode */
    hadc->Instance->CTRL1 &= ~(ADC_CTRL1_DISCNUMCFG);
    hadc->Instance->CTRL1 |=  ADC_CTRL1_DISCONTINUOUS(hadc->Init.NbrOfDiscConversion);
  }
  else
  {
    /* Disable the selected ADC regular discontinuous mode */
    hadc->Instance->CTRL1 &= ~(ADC_CTRL1_REGDISCEN);
  }

  /* Set ADC number of conversion */
  hadc->Instance->REGSEQ1 &= ~(ADC_REGSEQ1_REGSEQLEN);
  hadc->Instance->REGSEQ1 |=  ADC_REGSEQ1(hadc->Init.NbrOfConversion);

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F411xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
  /* Enable or disable ADC DMA continuous request */
  hadc->Instance->CTRL2 &= ~(ADC_CTRL2_DMADISSEL);
  hadc->Instance->CTRL2 |= ADC_CTRL2_DMAENContReq((uint32_t)hadc->Init.DMAContinuousRequests);

  /* Enable or disable ADC end of conversion selection */
  hadc->Instance->CTRL2 &= ~(ADC_CTRL2_EOCSEL);
  hadc->Instance->CTRL2 |= ADC_CTRL2_EOCSELelection(hadc->Init.EOCSelection);
#endif /* APM32F405xx || APM32F407xx || APM32F411xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

#if defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
  /* Set ADC oversampling mode */
  if (hadc->Init.OversamplingMode == ENABLE)
  {
    ASSERT_PARAM(IS_ADC_OVERSAMPLING_RATIO(hadc->Init.Oversampling.Ratio));
    ASSERT_PARAM(IS_ADC_OVERSAMPLING_SHIFT(hadc->Init.Oversampling.RightBitShift));
    ASSERT_PARAM(IS_ADC_OVERSAMPLING_MODE(hadc->Init.Oversampling.TriggeredMode));

    if ((hadc->Init.ExternalTrigConv == ADC_SOFTWARE_START) || \
        (hadc->Init.ExternalTrigConvEdge == ADC_EXTERNALTRIGCONVEDGE_NONE))
    {
      /* Oversampling multi trigger is not applicable to software-triggered conversions */
      ASSERT_PARAM(hadc->Init.Oversampling.TriggeredMode == ADC_OVERSAMPLING_SINGLE_TRIGGER);
    }

    /* Set ADC oversampling parameters */
    MODIFY_REG(hadc->Instance->OSAMPCTRL,
               ADC_OSAMPCTRL_OSEN |
               ADC_OSAMPCTRL_OSR  |
               ADC_OSAMPCTRL_OSS  |
               ADC_OSAMPCTRL_TOS,
               ADC_OSAMPCTRL_OSEN                     |
               hadc->Init.Oversampling.Ratio          |
               hadc->Init.Oversampling.RightBitShift  |
               hadc->Init.Oversampling.TriggeredMode
              );
  }
#endif /* APM32F423xx || APM32F425xx || APM32F427xx */
}

/**
  * @brief  DMA transfer complete callback.
  * @param  hdma pointer to a DMA_HandleTypeDef structure that contains
  *                the configuration information for the specified DMA module.
  * @retval None
  */
static void ADC_DMAConvCplt(DMA_HandleTypeDef *hdma)
{
  /* Retrieve ADC handle corresponding to current DMA handle */
  ADC_HandleTypeDef* hadc = ( ADC_HandleTypeDef* )((DMA_HandleTypeDef* )hdma)->Parent;

  /* Update state machine on conversion status if not in error state */
  if (DAL_IS_BIT_CLR(hadc->State, DAL_ADC_STATE_ERROR_INTERNAL | DAL_ADC_STATE_ERROR_DMA))
  {
    /* Update ADC state machine */
    SET_BIT(hadc->State, DAL_ADC_STATE_REG_EOC);

    /* Determine whether any further conversion upcoming on group regular   */
    /* by external trigger, continuous mode or scan sequence on going.      */
    /* Note: On APM32F4, there is no independent flag of end of sequence.   */
    /*       The test of scan sequence on going is done either with scan    */
    /*       sequence disabled or with end of conversion flag set to        */
    /*       of end of sequence.                                            */
#if defined(APM32F403xx) || defined(APM32F402xx)
    if(ADC_IS_SOFTWARE_START_REGULAR(hadc)                   &&
       (hadc->Init.ContinuousConvMode == DISABLE))
#else
    if(ADC_IS_SOFTWARE_START_REGULAR(hadc)                   &&
       (hadc->Init.ContinuousConvMode == DISABLE)            &&
       (DAL_IS_BIT_CLR(hadc->Instance->REGSEQ1, ADC_REGSEQ1_REGSEQLEN) ||
        DAL_IS_BIT_CLR(hadc->Instance->CTRL2, ADC_CTRL2_EOCSEL)  )   )
#endif /* APM32F403xx || APM32F402xx */
    {
      /* Disable ADC end of single conversion interrupt on group regular */
      /* Note: Overrun interrupt was enabled with EOC interrupt in          */
      /* DAL_ADC_Start_IT(), but is not disabled here because can be used   */
      /* by overrun IRQ process below.                                      */
      __DAL_ADC_DISABLE_IT(hadc, ADC_IT_EOC);

