betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_adc.c
      /* Set ADC state */
      CLEAR_BIT(hadc->State, DAL_ADC_STATE_REG_BUSY);

      if (DAL_IS_BIT_CLR(hadc->State, DAL_ADC_STATE_INJ_BUSY))
      {
        SET_BIT(hadc->State, DAL_ADC_STATE_READY);
      }
    }

    /* Conversion complete callback */
#if (USE_DAL_ADC_REGISTER_CALLBACKS == 1)
    hadc->ConvCpltCallback(hadc);
#else
    DAL_ADC_ConvCpltCallback(hadc);
#endif /* USE_DAL_ADC_REGISTER_CALLBACKS */
  }
  else /* DMA and-or internal error occurred */
  {
    if ((hadc->State & DAL_ADC_STATE_ERROR_INTERNAL) != 0UL)
    {
      /* Call DAL ADC Error Callback function */
#if (USE_DAL_ADC_REGISTER_CALLBACKS == 1)
      hadc->ErrorCallback(hadc);
#else
      DAL_ADC_ErrorCallback(hadc);
#endif /* USE_DAL_ADC_REGISTER_CALLBACKS */
    }
	else
	{
      /* Call DMA error callback */
      hadc->DMA_Handle->XferErrorCallback(hdma);
    }
  }
}

/**
  * @brief  DMA half transfer complete callback.
  * @param  hdma pointer to a DMA_HandleTypeDef structure that contains
  *                the configuration information for the specified DMA module.
  * @retval None
  */
static void ADC_DMAHalfConvCplt(DMA_HandleTypeDef *hdma)
{
  ADC_HandleTypeDef* hadc = ( ADC_HandleTypeDef* )((DMA_HandleTypeDef* )hdma)->Parent;
   /* Half conversion callback */
#if (USE_DAL_ADC_REGISTER_CALLBACKS == 1)
  hadc->ConvHalfCpltCallback(hadc);
#else
  DAL_ADC_ConvHalfCpltCallback(hadc);
#endif /* USE_DAL_ADC_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA error callback
  * @param  hdma pointer to a DMA_HandleTypeDef structure that contains
  *                the configuration information for the specified DMA module.
  * @retval None
  */
static void ADC_DMAError(DMA_HandleTypeDef *hdma)
{
  ADC_HandleTypeDef* hadc = ( ADC_HandleTypeDef* )((DMA_HandleTypeDef* )hdma)->Parent;
  hadc->State= DAL_ADC_STATE_ERROR_DMA;
  /* Set ADC error code to DMA error */
  hadc->ErrorCode |= DAL_ADC_ERROR_DMA;
   /* Error callback */
#if (USE_DAL_ADC_REGISTER_CALLBACKS == 1)
  hadc->ErrorCallback(hadc);
#else
  DAL_ADC_ErrorCallback(hadc);
#endif /* USE_DAL_ADC_REGISTER_CALLBACKS */
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* DAL_ADC_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

